@extends('mobile.default')

@section('title')Загрузка приложения@endsection
@section('styles')
<style>
    .floating-button {
      text-decoration: none;
      display: inline-block;
      width: 140px;
      height: 45px;
      line-height: 45px;
      border-radius: 45px;
      margin: 10px 20px;
      font-family: 'Montserrat', sans-serif;
      font-size: 11px;
      text-transform: uppercase;
      text-align: center;
      letter-spacing: 3px;
      font-weight: 600;
      color: #524f4e;
      background: white;
      box-shadow: 0 8px 15px rgba(0, 0, 0, .1);
      transition: .3s;
    }
    .floating-button:hover {
      background: #2EE59D;
      box-shadow: 0 15px 20px rgba(46, 229, 157, .4);
      color: white;
      transform: translateY(-7px);
    }

    p{
   font-family: 'Playfair Display', serif;
   font-size: 26px;
   text-align: center;
   letter-spacing: 2px;
   color: black;
    }
    p1{
font-family: 'Playfair Display', serif;
font-size: 20px;
letter-spacing: 2px;

padding-left: 10px;
 }
 h3,h4{padding-left: 10px;}
 .layer {
    overflow: scroll;
    height: 500px; 
    padding: 5px; 
    border: solid 1px black; 
   } 
</style>

@endsection
@section('content')


<h1 align="center">Лаззат</h1>
<p>Мобильное приложение:	&#128241; <a href="https://disk.yandex.ru/d/rblQaycZ78g9ZA" class="floating-button">Скачать 	&#128241;</a></p>
<p>Стационарное приложение: <a href="https://disk.yandex.ru/d/OZcFEX_v0M2cmA"  class="floating-button">Скачать</a></p>
<br>&nbsp;&nbsp;
<div class="layer">
<h3>Порядок установки и запуска программы</h3>
<p1>1) Скачайте приложение с сайта;</p1><br>
<p1>2) Запустите только что скачанный вами приложение;</p1><br>
<p1>3) Программа готова к использованию</p1><br><br>
<h3>Работа с исходными данными "Официанту"</h3>
<h4>Данная программа предусматривает работу с основными данными о заказах. </h4>
<p1>— Для добавления блюда необходимо выбрать пункт меню <b>Блюда–категорию блюда</b> после чего 
можно добавить блюда в корзину. </p1><br>
<p1>— Для просмотра добавленного блюда необходимо выбрать пункт меню <b>Корзина</b>, все добавленные вами 
блюда будут переходить в корзину, после чего 
можно изменить количество блюда, если же все верно, нажмите кнопку <b>"сохранить заявку"</b>, 
далее необходимо выбрать количество <b>гостей</b>, а также <b>стол</b>, далее этот заказ отправится поварам.</p1>
<br><br>
<h3>Работа с исходными данными "Администратору"</h3>
<h4>Данная программа предусматривает работу с основными данными о заказах, сотрудниках а также с аналитикой.</h4> 

<h3>Сотрудники</h3>

<p1>— Для просмотра списка <b>сотрудников</b>  необходимо выбрать пункт меню <b>Сотрудники</b> после чего 
можно посмотреть список сотрудников. </p1><br>
<p1>— Для изменения роли сотрудникам необходимо выбрать сотрудника, нажать рядом с сотрудником на вертикальные три точки после чего 
можно изменить роль сотрудников. </p1><br>
<br>

<h3>Категории блюд</h3>

<p1>— Для добавления категории блюда выберите пункт меню <b>Категории блюд</b>, далее нажмите на кнопку добавить, после чего добавьте название и фото категории.</p1><br>
<p1>— Для изменения уже существующей категории блюд выберите пункт меню <b>Категории блюд</b>, далее выберите нужную категорию блюда 
для изменения и нажмите рядом с ней на вертикальные три точки, появятся 3 значения "Редактировать", "Просмотреть блюда","Архивировать",  
нам нужно выбрать первое значение "Редактировать", после редактирвования не забудьте <b>сохранить изменения.</b></p1><br>
<p1>— Для просмотра уже существующей категории блюд выберите пункт меню <b>Категории блюд</b>, далее выберите нужную категорию блюда 
для просмотра и нажмите рядом с ней на вертикальные три точки, появятся 3 значения "Редактировать", "Просмотреть блюда", "Архивировать",  
нам нужно выбрать второе значение "Просмотреть блюда", после чего вы увидите блюда в выбранной категории</p1><br>
<p1>— Для архивирования уже существующей категории блюд выберите пункт меню <b>Категории блюд</b>, далее выберите нужную категорию блюда 
для архивации и нажмите рядом с ней на вертикальные три точки, появятся 3 значения "Редактировать", "Просмотреть блюда", "Архивировать",  
нам нужно выбрать третье значение "Архивировать", после чего данная категория добавиться в архив, также вы можете его разархировать</p1><br>
  </div>


@endsection